#!/usr/bin/perl

#--------------------------------------------------------------------
# Дополнительные модули
#--------------------------------------------------------------------

use CGI;
use DBI;

use strict;
use warnings;

#--------------------------------------------------------------------
# Объявление переменных
#--------------------------------------------------------------------

# База данных
my $mode = "SQLite"; # режим работы
my $base = "dbase/base.db"; # файл базы

# Другие URL ссылки
my $err  = "http://google.com"; # нет в базе

#--------------------------------------------------------------------
# Подключение к базе данных
#--------------------------------------------------------------------

my $dsn = "DBI:$mode:dbname=$base";

my $dbh = DBI->connect($dsn, "", "", { RaiseError => 1, AutoCommit => 1 })
    or die $DBI::errstr;

#--------------------------------------------------------------------
# Создание объекта CGI
#--------------------------------------------------------------------

my $q = CGI->new;

#--------------------------------------------------------------------
# Получение даты и времени
#--------------------------------------------------------------------

my $date = get_date();

#--------------------------------------------------------------------
# Редирект по короткой ссылке
#--------------------------------------------------------------------

if ($q->param('r')) {

    my $redir = $q->param('r');

    # Выражения для защиты от SQL-инъекций
    my $sth = $dbh->prepare_cached("SELECT id, url, click FROM base WHERE link = '$redir' LIMIT 1");
       $sth->execute;

    # Если ссылка есть в базе
    if (my ($id, $url, $click) = $sth->fetchrow_array) {

        $click++; # увеличиваем на 1

        $dbh->do("UPDATE base SET date = '$date', click = '$click' WHERE id = '$id'");

        $sth->finish;
        $dbh->disconnect;

        print $q->redirect($url);

        exit; # выход из приложения

    } else {

        $sth->finish;
        $dbh->disconnect;

        print $q->redirect($err);

        exit; # выход из приложения
    }
}

#--------------------------------------------------------------------
# Если нет параметров ссылки
#--------------------------------------------------------------------

else {

    print $q->redirect($err);

    exit; # выход из приложения
}

#####################################################################
#                                                                   #
# Дополнительные функции приложения                                 #
#                                                                   #
#####################################################################

#--------------------------------------------------------------------
# Получение даты и времени
#--------------------------------------------------------------------

sub get_date {

    my ($day, $mday, $year, $hour, $min, $sec) = (localtime)[3,4,5,2,1,0];
    my $date = sprintf("%02d.%02d.%04d", $day, $mday + 1, $year + 1900);
    my $time = sprintf("%02d:%02d:%02d", $hour, $min, $sec);

    $date = sprintf("%s %s", $date, $time); # dd.mm.yyyy hh:mm:ss

    return $date;
}
