#!/usr/bin/perl

#--------------------------------------------------------------------
# Дополнительные модули
#--------------------------------------------------------------------

use strict;
use warnings;

#--------------------------------------------------------------------
# Объявление переменных
#--------------------------------------------------------------------

my $dir = "../";
my $bak = "../backup";

#--------------------------------------------------------------------
# Создание резервной копии
#--------------------------------------------------------------------

print "Продолжить выполнение программы? (y/n): ";

chomp(my $run = <STDIN>); # удалить конец строки
$run = "\L$run"; # нижний регистр

if (($run eq "y") || ($run eq "yes")) {

    # Получение даты и времени
    my ($day, $mday, $year, $hour, $min, $sec) = (localtime)[3,4,5,2,1,0];
    my $date = sprintf("%02d.%02d.%04d", $day, $mday + 1, $year + 1900);
    my $time = sprintf("%02d:%02d:%02d", $hour, $min, $sec);

    #my $file = "backup\_$date\_$time.7z";
    #my $file = "backup\_$date\_$time.zip";
    my $file = "backup\_$date\_$time.tgz";

    #system("7z a $bak/$file $dir");
    #system("zip -r $bak/$file $dir");
    system("tar -czvf $bak/$file $dir");
    print "Файл: \x1b[32m$file\x1b[0m бэкапа успешно создан.\n";

} else {

    print "Процесс был прерван пользователем.\n";
}

exit; # выход из приложения