#!/usr/bin/perl

#--------------------------------------------------------------------
# Дополнительные модули
#--------------------------------------------------------------------

use DBI;
use strict;
use warnings;

#--------------------------------------------------------------------
# Объявление переменных
#--------------------------------------------------------------------

my $mode = "SQLite";
my $base = "../dbase/base.db";
my $file = "../setup/base.sql";

#--------------------------------------------------------------------
# Проверка наличие базы данных
#--------------------------------------------------------------------

if(-f $base) {

    print "Файл: \x1b[31m$base\x1b[0m уже существует, удалить его? (y/n): ";

    chomp(my $del = <STDIN>); # удалить конец строки
    $del = "\L$del"; # нижний регистр

    if (($del eq "y") || ($del eq "yes")) {

        # Удаляем старую резервную копию
        if (-f "$base.bak") { unlink "$base.bak" or die($!); }

        # Делаем копию текущей базы
        system("cp $base $base.bak");
        print "Файл: \x1b[32m$base.bak\x1b[0m резервная копия базы данных создана.\n";

        # Удаляем текущею базу данных
        unlink $base or die($!);

        print "Файл: \x1b[32m$base\x1b[0m старая база данных успешно удалена.\n";

    } else {

        print "Процесс был прерван пользователем.\n";

        exit; # выход из приложения
    }
}

#--------------------------------------------------------------------
# Подключение к базе данных
#--------------------------------------------------------------------

my $dsn = "DBI:$mode:dbname=$base";

my $dbh = DBI->connect($dsn, "", "", { RaiseError => 1, AutoCommit => 1 })
    or die $DBI::errstr;

#--------------------------------------------------------------------
# Создание таблиц в базе данных
#--------------------------------------------------------------------

print "Продолжить выполнение программы? (y/n): ";

chomp(my $run = <STDIN>); # удалить конец строки
$run = "\L$run"; # нижний регистр

if (($run eq "y") || ($run eq "yes")) {

    open(SQL, $file) or die($!);
        local $/ = undef; # файл целиком
        my $table = <SQL>;
    close(SQL);

    print "Файл: \x1b[32m$file\x1b[0m база данных успешно открыта.\n";

    $dbh->do($table) or die $DBI::errstr;

    print "Файл: \x1b[32m$base\x1b[0m база данных успешно создана.\n";

} else {

    print "Процесс был прерван пользователем.\n";
}

#--------------------------------------------------------------------
# Отключение от базы данных
#--------------------------------------------------------------------

$dbh->disconnect;

exit; # выход из приложения
